Tekla Open API Reference for Tekla Structures 2025
PlacingTypes.AlongLinePlacing Method
 The object is located and moved along a line defined by two points.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PlacingBase AlongLinePlacing(
	Point StartPoint,
	Point EndPoint
)
Public Shared Function AlongLinePlacing (
	StartPoint As Point,
	EndPoint As Point
) As PlacingBase
Parameters
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The first point of the line.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The second point of the line.
Return Value
Type: PlacingBase
A new along line placing instance.
See Also
Reference
PlacingTypes Class
Tekla.Structures.Drawing Namespace